//================================================================================================================
// DataManager.cpp
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		クラスをまたいで情報にアクセスするためのクラス
		Set関数、Get関数を使って情報にアクセスする
*/
//================================================================================================================
// バージョン
//		1.0 クラス生成                              2017/02/21 戸軽隆二 
//		1.1 勇者・母・敵の情報を追加                2017/02/22 戸軽隆二 
//================================================================================================================
#include "DataManager.h"

using namespace cocos2d;
//=========================================================================================================================
// セット関数：値を変更
//=========================================================================================================================

// 勇者の情報を格納
void DataManager::SetHero(Sprite* sp) { hero = sp; }
// お母さんの情報を格納
void DataManager::SetMother(Sprite* sp) { mother = sp; }
// 敵の情報を格納（全て）
void DataManager::SetEnemyCon(Vector<Sprite*> spCon) { enemyCon = spCon; }

//=========================================================================================================================
// ゲット関数：値を参照
//=========================================================================================================================

// 勇者の情報にアクセス
Sprite* DataManager::GetHero() { return hero; }
// お母さんの情報にアクセス
Sprite* DataManager::GetMother() { return mother; }
// 敵の情報にアクセス（全て）
Vector<Sprite*> DataManager::GetEnemyCon() { return enemyCon; }
