//================================================================================================================
// HitCheck.h
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		このクラスでは
		・敵と勇者（またはお母さん）同士の当たり判定
		・敵同士の当たり判定
		の２つの判定をするための関数があります。
　 使い方例
		HitCheck check;
		if (check.EnemyAndChara(敵の情報をVector<Sprite*>で, 勇者（またはお母さん）の情報をSprite*で) == true) {
			敵と勇者（またはお母さん）が触れている時の処理
		}
		if (check.EnemyAndEnemy(敵の情報をVector<Sprite*>で) == true){
			敵同士が触れている時の処理
		}
*/	
//================================================================================================================
// バージョン
//		1.0 クラス生成                              2017/02/21 戸軽隆二 
//================================================================================================================
#ifndef _HITCHECK_H_
#define _HITCHECK_H_

#include "cocos2d.h"

class HitCheck {
private:
public:
	bool EnemyAndEnemy(cocos2d::Vector<cocos2d::Sprite*> spCon);
	bool EnemyAndChara(cocos2d::Vector<cocos2d::Sprite*> spCon, cocos2d::Sprite* player);
};

#endif